{
  "index": {
    "why_rust": {
      "select_panel": {
        "security": {
          "src": "img/security.avif",
          "alt": "lock",
          "h3": "Sécurité de la Mémoire",
          "text": "Rust élimine élégamment les erreurs de gestion de la mémoire courantes, telles que les pointeurs nuls et les débordements de tampon. Son système de possession et de gestion de la mémoire garantit une sécurité sans sacrifier les performances, offrant ainsi une protection contre les failles de sécurité potentielles."
        },
        "performance": {
          "src": "img/speed.avif",
          "alt": "a speed meter",
          "h3": "Performances Exceptionnelles",
          "text": "Rust offre des performances exceptionnelles, rivalisant avec des langages bas niveau comme le C et le C++. Son modèle de propriété unique et son système de gestion de la mémoire permettent d'atteindre une efficacité optimale sans compromis sur la sécurité, en faisant un choix idéal pour les applications nécessitant rapidité et fiabilité."
        },
        "concurrency": {
          "src": "img/race.avif",
          "alt": "a race between athletes",
          "h3": "Concurrence Sans Douleur",
          "text": "La concurrence est native dans Rust grâce à son modèle d'exécution sans heurts. Rust intègre des fonctionnalités de gestion de la concurrence facilitant le développement d'applications parallèles sans les tracas traditionnels. Cela rend Rust particulièrement adapté aux systèmes distribués et aux applications gourmandes en ressources."
        },
        "abstraction": {
          "src": "img/helpful.avif",
          "alt": "a small robot",
          "h3": "Abstraction Sans Perte de Performance",
          "text": "Contrairement à certains langages, Rust offre des abstractions puissantes tout en maintenant un contrôle précis sur le matériel. Les traits et les génériques permettent de créer du code générique sans sacrifier l'efficacité, offrant ainsi une flexibilité sans compromettre la vitesse d'exécution."
        },
        "ecosystem": {
          "src": "img/group.avif",
          "alt": "Hands",
          "h3": "Écosystème Actif",
          "text": "Rust bénéficie d'une communauté dynamique et d'un écosystème en pleine expansion. Les crate (bibliothèques) disponibles offrent une grande variété de fonctionnalités, facilitant le développement de solutions rapides et robustes. La documentation et la communauté garantissent une expérience de développement fluide."
        },
        "use_case": {
          "src": "img/mobile.avif",
          "alt": "a mobile phone",
          "h3": "De multiples cas d'usage",
          "text": "Rust se distingue comme un langage de programmation moderne, offrant sécurité, performances et facilité de développement. Que vous travailliez sur des projets système, des applications embarquées ou des solutions cloud, Rust est un choix solide pour atteindre vos objectifs avec succès."
        }
      }
    },
    "use_case": {
      "web": {
        "h3": "<h3>Développement Web</h3>",
        "text": "<div><p>Rust est utilisé pour développer des applications web robustes, grâce à son système de sécurité et ses performances exceptionnelles.</p></div>"
      },
      "ai": {
        "h3": "<h3>Intelligence Artificielle</h3>",
        "text": "<div><p>Les performances de Rust en font un choix prometteur pour le développement d'applications d'intelligence artificielle.</p></div>"
      },
      "video_games": {
        "h3": "<h3>Développement de Jeux Vidéo</h3>",
        "text": "<div><p>Rust offre un contrôle précis sur le matériel, ce qui en fait un langage adapté au développement de jeux vidéo haute performance.</p></div>"
      },
      "embedded": {
        "h3": "<h3>Systèmes Embarqués</h3>",
        "text": "<div><p>Rust est utilisé pour le développement de systèmes embarqués, offrant à la fois la sécurité et la performance nécessaire.</p></div>"
      },
      "system": {
        "h3": "<h3>Programmation Système</h3>",
        "text": "<div><p>Rust excelle dans la programmation système, offrant une alternative sécurisée aux langages traditionnels. Il a fait son arrivée dans le Kernel Linux.</p></div>"
      }
    }
  },
  "contact": {
    "message": "Bien reçu, je reviens vers vous dans les meilleurs délais !"
  }
}
